#!/usr/bin/env python3 标准注释 可以让.py文件直接在Unix/Linux/Mac上运行
# -*- coding: utf-8 -*- 标准注释 表示.py文件本身使用标准UTF-8编码

'企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？'

__author__='lx' 

#方法一
x=int(input('净利润:'),10)
if x<=100000:
    bonus=x*0.1
    print ("奖金:",bonus,"元")
elif (x>100001) and (x<=200000):
    bonus=10000+(x-100000)*0.075
    print ("奖金:",bonus,"元")
elif (x>200001) and (x<=400000):
    bonus=10000+7500+(x-200000)*0.05
    print ("奖金:",bonus,"元")
elif (x>400001) and (x<=600000):
    bonus=10000+7500+10000+(x-400000)*0.03
    print ("奖金:",bonus,"元")
elif (x>600001) and (x<=1000000):
    bonus=10000+7500+10000+6000+(x-600000)*0.015
    print ("奖金:",bonus,"元")
elif (x>600001) and (x<=1000000):
    bonus=10000+7500+10000+6000+6000+(x-600000)*0.01
    print ("奖金:",bonus,"元")